app/controllers/api/v1/goals_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    render json: Project.all