app/controllers/api/v1/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    render json: Project.all

INSERT INTO "projects" ("creator_id", "name", "category", "long_desc", "short_desc", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    @project = Project.new(name: params[:name], category: params[:category], short_desc: params[:short_desc], long_desc: params[:long_desc], project_image: params[:project_image])
    @project.creator = current_user
    @project.save