app/controllers/api/v1/requests_controller.rb

    def create
      @request = Request.new(user: current_user, project_id: params[:id])
      @request.save

      render json: Project.all
---
INSERT INTO "requests" ("user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 10], ["project_id", 13], ["created_at", "2017-09-23 19:38:01.851276"], ["updated_at", "2017-09-23 19:38:01.851276"]]
SELECT "projects".* FROM "projects"