app/controllers/api/v1/skills_controller.rb

INSERT INTO "user_skills" ("user_id", "skill_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 10], ["skill_id", 1], ["created_at", "2017-09-26 02:51:25.496426"], ["updated_at", "2017-09-26 02:51:25.496426"]]
SELECT  "skills".* FROM "skills" WHERE "skills"."name" = $1 LIMIT $2  [["name", "HTML"], ["LIMIT", 1]]
---
  def create

    @skill = Skill.find_or_create_by(name: params[:name])