app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "password_digest", "bio", "role", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      @user = User.new(user_params)
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["latitude", "40.7049605"], ["longitude", "-74.0139564"], ["updated_at", "2017-09-25 20:24:40.739664"], ["id", 10]]
---
    def update
      @user = User.find(params[:id])
    		@user.update(latitude: params[:latitude], longitude: params[:longitude])